[
    {
        "id": 1,
        "name": "Job Hunting",
        "image": "https://firebasestorage.googleapis.com/v0/b/react-portfolio-76a20.appspot.com/o/Web-Development-Success.png?alt=media&token=cd212726-80f1-461b-bc80-3b031f2ee6ac",
        "githuburl": "https://github.com/Sesdesoir/GroupPjUno",
        "deployurl": "https://sesdesoir.github.io/GroupPjUno/",
        "description": "Created and developed by a group of amateur coders with the common goal of searching for web development opportunities. This web application can be used by both new and seasoned coders to understand the skillsets required by the most competitive software companies, in addition to searching for the newest job postings that fit the potential applicant's interests."
    },
    {
        "id": 2,
        "name": "Auto-ReadMe Generator",
        "image": "https://firebasestorage.googleapis.com/v0/b/react-portfolio-76a20.appspot.com/o/Auto-ReadMe-Generator.png?alt=media&token=f36235df-a12a-4244-b63e-5f07115651d2",
        "githuburl": "https://github.com/Artydabomb/Auto-ReadMe-New",
        "deployurl": "https://drive.google.com/file/d/1LwADZH_9Qcz3wnc4x-lwSLvm7TfnfKb7/view?usp=sharing",
        "description": "This project is used to auto-generate a README file based on a user answering prompted questions from a README template. This project used the Inquirer NPM to generate the questions for the README information. Then, using the user inputted responses, a markdown file is created in a fully formatted function for the user's convenience."
    },
    {
        "id": 3,
        "name": "E-Commerce Back End",
        "image": "https://firebasestorage.googleapis.com/v0/b/react-portfolio-76a20.appspot.com/o/E-Commerce-Backend.png?alt=media&token=f7c10cd5-50af-4ac7-a704-05dd8a985837",
        "githuburl": "https://github.com/Artydabomb/E-Commerce-Back-End",
        "deployurl": "https://drive.google.com/file/d/1GagOES1ReVB2k8EA12xD01Ll-uaPRv_B/view",
        "description": "This project allows a user to modify backend data by establishing written routes to modify the mentioned data. An environment that loosely simulates an e-commerce database, this project allows a user to add to, remove from or modify pre-existing items."
    },
    {
        "id": 4,
        "name": "Gym Management Database",
        "image": "https://firebasestorage.googleapis.com/v0/b/react-portfolio-76a20.appspot.com/o/Gym-Repository.png?alt=media&token=1c9a85f4-88cd-48b3-8f12-1f4b557f4ebd",
        "githuburl": "https://github.com/eroux13/gym_management_database",
        "deployurl": "https://intense-springs-12278.herokuapp.com/",
        "description": "For this project, we created a Gym Database Management application. This application manages a number of tables through Sequelize and MySQL2 which relate to the data types we expect a typical gym to utilize, including members, membership tiers, trainers, and gym classes. The front end of our application serves as an interface for gym administrators to manage information about the gym, as well as an online portal for gym members to sign in and register for classes or change their membership tier. The back end of our application utilizes a RESTful API to perform GET, POST, DELETE, and PUT requests on the information, as requested by front end input. Our folder structure was built around the MVC paradigm, to ensure smooth development between the four collaborators on this project. Additionally, we practiced agile project management to help ensure that we kept pace with our development timeline."
    },
    {
        "id": 5,
        "name": "Employee Management System",
        "image": "https://firebasestorage.googleapis.com/v0/b/react-portfolio-76a20.appspot.com/o/Employee-Tracker.png?alt=media&token=6ca4e797-a0bd-43e7-a1a7-ea475f3df60f",
        "githuburl": "https://github.com/Artydabomb/Employee-Tracker",
        "deployurl": "https://drive.google.com/file/d/11S37r_U7eaWDLgHPVuWqFwwy5ICxZTKf/viewhttps://sesdesoir.github.io/GroupPjUno/",
        "description": "To create a content management system for a company that keeps track of their employees by detailing their role in the company, their salary and their respective manager. This project incorporates the use of databases from MySQL, using the MYSQL NPM package to retrieve data from a MySQL database (org_DB). The application uses an Inquirer Package to prompt input from a user."
    }
]